tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "shopify/shopify", trusted: { formulae: ["shopify-cli"] }
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Image format providing lossless and lossy compression for web images
brew "webp"
# TIFF library and utilities
brew "libtiff"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Send macOS notifications from the command-line (used by scripts/claude-notify.sh)
brew "terminal-notifier"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# UNIX shell (command interpreter)
brew "zsh"
# Configuration manager for AI coding agents
cask "cc-switch"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# AI chat assistant from Moonshot
cask "kimi"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
npm "corepack"
